CfdOfRuns/vonKarman2D/case/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

// Patches to create.
patches
(
    {
        name constraint;
        patchInfo
        {
            type empty;
        }
        constructFrom patches;
        patches ( "patch_1_.*" );
    }

    {
        name constraint001;
        patchInfo
        {
            type empty;
        }
        constructFrom patches;
        patches ( "patch_2_.*" );
    }

    {
        name wall;
        patchInfo
        {
            type wall;
        }
        constructFrom patches;
        patches ( "patch_3_.*" );
    }

    {
        name inlet;
        patchInfo
        {
            type patch;
        }
        constructFrom patches;
        patches ( "patch_4_.*" );
    }

    {
        name outlet;
        patchInfo
        {
            type patch;
        }
        constructFrom patches;
        patches ( "patch_5_.*" );
    }

    {
        name open;
        patchInfo
        {
            type patch;
        }
        constructFrom patches;
        patches ( "patch_6_.*" );
    }

    {
        name open001;
        patchInfo
        {
            type patch;
        }
        constructFrom patches;
        patches ( "patch_7_.*" );
    }

    {
        name defaultFaces;
        patchInfo
        {
            type patch;
        }
        constructFrom patches;
        patches ( "patch_0_.*" );
    }


);


// ************************************************************************* //
