CfdOfRuns/vonKarman2D/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2012                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       81271;
    }
    constraint
    {
        type            empty;
        inGroups        1(empty);
        nFaces          40720;
        startFace       81271;
    }
    constraint001
    {
        type            empty;
        inGroups        1(empty);
        nFaces          40720;
        startFace       121991;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          80;
        startFace       162711;
    }
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       162791;
    }
    outlet
    {
        type            patch;
        nFaces          142;
        startFace       162891;
    }
    open
    {
        type            patch;
        nFaces          200;
        startFace       163033;
    }
    open001
    {
        type            patch;
        nFaces          200;
        startFace       163233;
    }
)

// ************************************************************************* //
