CfdOfRuns/vonKarman2D/case/0/vorticity
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2106                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      vorticity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<vector> 
40720
(
(-1.5299441e-18 -7.6497203e-18 -0.99707324)
(2.1863902e-17 1.0931951e-16 -5.9579133e-15)
(-2.1076682e-18 -1.0538341e-17 1.9759389e-16)
(0 -0 -1.3535571e-14)
(2.6558445e-19 1.3279223e-18 -1.3817031e-14)
(0 -0 6.0102425e-15)
(0 -0 3.5835283e-16)
(-1.5611359e-21 -7.8056795e-21 1.319234e-14)
...
)
;

boundaryField
{
    defaultFaces
    {
        type            empty;
    }
    constraint
    {
        type            empty;
    }
    constraint001
    {
        type            empty;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<vector> 
80
(
(-7.1433657e-19 -3.5716829e-18 198.12637)
(1.2719374e-18 6.359687e-18 186.70464)
(-8.0748252e-19 -4.0374126e-18 153.40359)
(-1.3882785e-16 -6.9413924e-16 180.99209)
(-1.4002227e-16 -7.0011135e-16 216.38416)
(-3.2222123e-18 -1.6111061e-17 418.43161)
(-2.2189524e-16 -1.1094762e-15 452.92521)
(0 -0 365.63407)
...
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
100
(
(-1.5299441e-18 -7.6497203e-18 0)
(-9.436193e-19 -4.7180965e-18 0)
(8.9718606e-19 4.4859303e-18 0)
(0 -0 7.1611881e-16)
(0 -0 -7.1752666e-16)
(0 -0 0)
(-3.5060061e-21 -1.753003e-20 7.1803004e-16)
(3.5059904e-21 1.7529952e-20 -7.1802683e-16)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
142
(
(0 -0 6.069783e-15)
(-4.3736794e-18 -2.1868397e-17 0)
(0 -0 0)
(-1.0569473e-18 -5.2847367e-18 0)
(1.0623317e-18 5.3116584e-18 0)
(-6.6539907e-20 -3.3269954e-19 -6.8136865e-15)
(0 -0 1.3638179e-14)
(0 -0 -1.3641385e-14)
...
)
;
    }
    open
    {
        type            calculated;
        value           nonuniform List<vector> 
200
(
(-1.5299441e-18 -7.6497203e-18 -0.99707324)
(2.1863902e-17 1.0931951e-16 1.0385354e-15)
(-2.1076682e-18 -1.0538341e-17 1.9759389e-16)
(0 -0 -6.6059401e-18)
(2.6558445e-19 1.3279223e-18 -2.1910717e-16)
(0 -0 -8.0347278e-16)
(0 -0 3.5835283e-16)
(-1.5611359e-21 -7.8056795e-21 -4.4907375e-16)
...
)
;
    }
    open001
    {
        type            calculated;
        value           nonuniform List<vector> 
200
(
(0 -0 -0.99685758)
(-4.3736834e-18 -2.1868417e-17 1.7494734e-15)
(-4.2154779e-18 -2.1077389e-17 0)
(2.1138963e-18 1.0569482e-17 -1.6911171e-15)
(1.3279156e-18 6.6395781e-18 1.699732e-15)
(-1.3307992e-19 -6.653996e-19 0)
(1.6648181e-19 8.3240903e-19 -1.7047737e-15)
(-3.3304189e-20 -1.6652095e-19 1.7051745e-15)
...
)
;
    }
}


// ************************************************************************* //
